# 1.Using isna() or isnull():
These methods return a DataFrame of the same shape, but with Boolean values indicating whether each value is missing (True) or not (False).

In [1]:
import pandas as pd
df=pd.read_csv("st.csv")
df

    st_id     name  age  marks  Gender
0       1     rani   32     90  female
1       2     raja   43     98    male
2       1   shital   23     89     NaN
3       3  shalini   24     90     NaN
4       4      ram   43     87    male
5       5     shiv   34     76     NaN
6       6    priya   54     79  female
7       7   pritam   45     70    male
8       8    payal   48     78  female
9       9  siddhhi   39     77  female
10     10   nikhil   30     88    male

In [3]:
# Check for missing values
missing_values = df.isna()
print(missing_values)

    st_id   name    age  marks  Gender
0   False  False  False  False   False
1   False  False  False  False   False
2   False  False  False  False    True
3   False  False  False  False    True
4   False  False  False  False   False
5   False  False  False  False    True
6   False  False  False  False   False
7   False  False  False  False   False
8   False  False  False  False   False
9   False  False  False  False   False
10  False  False  False  False   False

In [4]:
missing_values = df.isnull()
print(missing_values)

    st_id   name    age  marks  Gender
0   False  False  False  False   False
1   False  False  False  False   False
2   False  False  False  False    True
3   False  False  False  False    True
4   False  False  False  False   False
5   False  False  False  False    True
6   False  False  False  False   False
7   False  False  False  False   False
8   False  False  False  False   False
9   False  False  False  False   False
10  False  False  False  False   False

In [ ]:
Using notna() or notnull():
These methods return the opposite of isna()/isnull(), showing True for non-missing values.

In [5]:
not_miss = df.notna()
print(not_miss)

    st_id  name   age  marks  Gender
0    True  True  True   True    True
1    True  True  True   True    True
2    True  True  True   True   False
3    True  True  True   True   False
4    True  True  True   True    True
5    True  True  True   True   False
6    True  True  True   True    True
7    True  True  True   True    True
8    True  True  True   True    True
9    True  True  True   True    True
10   True  True  True   True    True

Summarizing missing values using sum():
To get a quick summary of the number of missing values in each column, you can sum the Boolean DataFrame returned by isna().

In [6]:
missing_summary = df.isna().sum()
print(missing_summary)

st_id     0
name      0
age       0
marks     0
Gender    3
dtype: int64

4.Using info():
The info() method provides a concise summary of the DataFrame, including the number of non-null values in each column

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   st_id   11 non-null     int64
 1   name    11 non-null     object
 2   age     11 non-null     int64
 3   marks   11 non-null     int64
 4   Gender  8 non-null      object
dtypes: int64(3), object(2)
memory usage: 572.0+ bytes

5.Checking for any missing values in the entire DataFrame:
To check if there are any missing values in the entire DataFrame, you can use isna().values.any().

In [9]:
any_missing = df.isna().values.any()
print(any_missing)

True

Finding rows with missing values:
You can filter the DataFrame to get rows with missing values using isna().any(axis=1).

python

In [11]:
rows_with_missing = df[df.isna().any(axis=1)]
print(rows_with_missing)

   st_id     name  age  marks Gender
2      1   shital   23     89    NaN
3      3  shalini   24     90    NaN
5      5     shiv   34     76    NaN